brew "xz"
brew "bat"
brew "cmake"
brew "ctags"
brew "fd"
brew "ffmpeg"
brew "pmix"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "libtool"
brew "graphviz"
brew "pkgconf"
brew "httpie"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "portaudio"
brew "powerlevel10k"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "ruff"
brew "swig"
brew "tinyxml2"
brew "tmux"
brew "tree"
brew "uv"
brew "vips"
brew "wget"
brew "zoxide"
cask "alacritty"
cask "amazon-q"
cask "corretto"
cask "font-meslo-lg-nerd-font"
cask "maccy"
cask "orbstack"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anysphere.pyright"
vscode "anysphere.remote-containers"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "irongeek.vscode-env"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "tamasfe.even-better-toml"
vscode "uloco.theme-bluloco-light"
vscode "vscodevim.vim"
vscode "vue.volar"
